# HideUnreferencedViewTags Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..HideUnreferencedViewTags Property
PrintParameters Class See Also
---
Indicates whether to hide unreferenced view tags when printing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HideUnreferencedViewTags { get; set; }
```

Visual Basic
---
```text
Public Property HideUnreferencedViewTags As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideUnreferencedViewTags {
	bool get ();
	void set (bool value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace